/* Задание 1. Реализуйте функцию list_lengths(List), которая возвращает список длин списков,
входящих в List и пропускает все остальные элементы.
list_lengths([[1,2,3], {true,3}, [4,5], []]) => [3,2,0] */

% Тут должно быть решение

% Тут должны быть запросы для проверки

/* Задание 2. Не смотря на определение в модуле lists стандартной библиотеки, реализуйте
функцию all(Pred, List).
Она возвращает true, если Pred возвращает true для всех элементов List, и false,
если это не так.
all(fun(X) -> X < 10 end, [1,3,9,11,6]) => false
all(fun(X) -> X < 10 end, [1,3,9,6]) => true */

% Тут должно быть решение

% Тут должны быть запросы для проверки

/* Задание 3. Реализуйте функцию min_value(F, N), которая возвращает минимальное
значение функции F на целых числах от 1 до N.
max_value(fun(X) -> X rem 5 end, 10) => 0 */

% Тут должно быть решение

% Тут должны быть запросы для проверки

/* Задание 4. Реализуйте функцию group_by(Fun, List), которая разбивает список List на
отрезки, на идущих подряд элементах которых Fun (предикат от двух переменных)
возвращает true.
group_by(fun(X, Y) <- X =< Y end, [1,2,4,3,2,5]) => [[1,2,4], [3], [2,5]] */

% Тут должно быть решение

% Тут должны быть запросы для проверки
