/* Задание 1. Для каждой последовательности символов скажите, является ли она атомом,
переменной, сложным термом или вообще не термом:
1. переменная
2. 'язык Пролог'
3. Пролог
4. Альберт(любит, мясо)
5. любит(Альберт, мясо) */

% Тут должно быть решение

% Тут должны быть запросы для проверки

/* Задание 2. Какие сопоставления удадутся (и с какими значениями переменных)?
1. meal(food(Y), X) = meal(X, drink(Z))
2. food(bread, X, beer) = food(Y, burger)
3. likes(X, cola) = likes(Y, cola)
4. 'bread' = bread
5. likes(X, food(Y)) = likes(Y, food(Z)) */

% Тут должно быть решение

% Тут должны быть запросы для проверки

/* Задание 3. Сформулируйте запрос на языке Prolog:
1. Найти дочерей Оли.
2. Является ли кто-то из родителей Насти ребёнком Алексея? */

% Тут должно быть решение

% Тут должны быть запросы для проверки

/* Задание 4. Сформулируйте как правило на языке Prolog: Ночью все кошки серы. */

% Тут должно быть решение

% Тут должны быть запросы для проверки

/* Задание 5. В базе данных, описанной файлом family.pl, задайте правилами предикат
племянник/2. племянник(X, Y) означает, что X -- племянник Y. */

% Тут должно быть решение

% Тут должны быть запросы для проверки
