/* Задание 1. Задайте функцию distance(P1, P2), находящую расстояние между точками P1 и
P2, каждая из которых задана как кортеж из двух чисел. Используйте
библиотечную функцию math:sqrt().
distance({1.0, 2.0}, {0.0, 1.0}) => sqrt(2) (приближённо 1.4142...) */

% Тут должно быть описано решение

% Тут должны быть запросы для проверки

/* Задание 2. Задайте функцию insert(List, X), которая получает отсортированный в порядке
возрастания список List и число X, и добавляет X в List так, чтобы снова получить
список в порядке возрастания.
insert([1, 1.5, 2, 2.5, 3.5], 3) => [1, 1.5, 2, 2.5, 3, 3.5]. */

% Тут должно быть описано решение

% Тут должны быть запросы для проверки

/* Задание 3. Задайте функцию drop_every(List, N), удаляющую каждый N-ый элемент из
списка List.
drop_every([1,2,3,4,5,6,7], 2) => [1,3,5,7]
drop_every([1,2,3,4,5,6,7], 3) => [1,2,4,5,7] */

% Тут должно быть описано решение

% Тут должны быть запросы для проверки

/* Задание 4. Задайте функцию rle_decode(EncodedList), которая работает противоположно
функции rle_encode из варианта 1.
decode([{a,3},b,{c,2},{a,2}]) => [a,a,a,b,c,c,a,a] */

% Тут должно быть описано решение

% Тут должны быть запросы для проверки

/* Задание 5. Задайте функцию diagonal(Matrix), которая возвращает диагональ матрицы,
заданной как список списков.
diagonal([[1,2,3], [4,5,6], [7,8,9]]) => [1,5,9] */

% Тут должно быть описано решение

% Тут должны быть запросы для проверки
