/* Задание 1. Реализуйте функцию flatten(bin_tree) -> list. flatten(Tree) возвращает список всех
данных в дереве в порядке возрастания. */

% Тут должно быть решение

% Тут должны быть запросы для проверки

/* Задание 2. Разработайте интерфейс для абстрактного типа данных "словарь". Словарь позволяет хранить 
произвольное число пар ключ-значение без определённого порядка, при этом две пары с одним ключом
одновременно не допускаются. */

% Источник: http://ru.wikipedia.org/wiki/%D0%90%D1%81%D1%81%D0%BE%D1%86%D0%B8
%D0%B0%D1%82%D0%B8%D0%B2%D0%BD%D1%8B%D0%B9_%D0%BC%D0
%B0%D1%81%D1%81%D0%B8%D0%B2

% Тут должно быть решение

% Тут должны быть запросы для проверки

/* Задание 3. Реализуйте над этим интерфейсом функцию all_values(dictionary) -> [any].
all_values(Dict) возвращает список всех значений в словаре. */

% Тут должно быть решение

% Тут должны быть запросы для проверки

/* Задание 4. Реализуйте над этим интерфейсом функцию all_values(dictionary) -> [any].
all_values(Dict) возвращает список всех значений в словаре. *.

% Тут должно быть решение

% Тут должны быть запросы для проверки
